// while loop

// ჯერ ამოწმებს პირობას, და მხოლოდ მაშინ ასრულებს ციკლს, თუ პირობა ჭეშმარიტია (true).

// თუ პირობა თავიდანვე მცდარია, ლუპი საერთოდ არ შესრულდება.

// მაგალითი:

// let i = 1;

// while (i <= 3) { // ჯერ ამოწმებს პირობას
//   console.log(i); // შემდეგ ასრულებს მოქმედებას
//   i++;
// }
// გამოიტანს: 1, 2, 3

// do...while loop

// ჯერ ერთხელ მაინც ასრულებს ციკლის შიგთავსს,
// და მხოლოდ ამის შემდეგ ამოწმებს პირობას.

// ამიტომ, ლუპის შიგთავსი მინიმუმ ერთხელ მაინც შესრულდება, თუნდაც პირობა თავიდანვე ცრუ იყოს.

// მაგალითი:

// let i = 5;

// do {
//   console.log(i); // ეს შესრულდება ერთხელ მაინც
//   i++;
// } while (i < 5); // პირობა თავიდანვე ცრუა
// გამოიტანს: 5
