// JavaScript-ში ცვლადის შესაქმნელად ვიყენებთ სამ საკვანძო სიტყვას:
// 1) var – ძველი მეთოდი, იშვიათად გამოიყენება
// 2) let – გამოიყენება ცვლადებისთვის, რომლებიც შეიძლება შეიცვალოს
// 3) const – გამოიყენება მუდმივებისთვის, ანუ მნიშვნელობა ერთხელ ენიჭება და აღარ იცვლება

// მაგალითები:

// var – ძველი მეთოდი, შეიძლება თავიდანაც დავწეროთ იგივე ცვლადი
var x = 10;  // ცვლადი x-ის მნიშვნელობაა 10

// let – თანამედროვე მეთოდი ცვლადისთვის
let age = 20; // აქ შევქმენით age ცვლადი და მივანიჭეთ 20

// const – მუდმივი ცვლადი
const PI = 3.14; // ეს მნიშვნელობა ვერ შეიცვლება