// მომხმარებელს ვეკითხებით პირველ რიცხვს
let num1 = prompt("შეიყვანე პირველი რიცხვი:");
num1 = Number(num1); // სტრიქონს რიცხვად ვაქცევთ

// მომხმარებელს ვეკითხებით მეორე რიცხვს
let num2 = prompt("შეიყვანე მეორე რიცხვი:");
num2 = Number(num2);

// ვასრულებთ ყველა მათემატიკურ ოპერაციას და შედეგებს ვბეჭდავთ როგორც console-ში ასევე alert-ით

// მიმატება
console.log("მიმატება: " + (num1 + num2));
alert("მიმატება: " + (num1 + num2));

// გამოკლება
console.log("გამოკლება: " + (num1 - num2));
alert("გამოკლება: " + (num1 - num2));

// გამრავლება
console.log("გამრავლება: " + (num1 * num2));
alert("გამრავლება: " + (num1 * num2));

// გაყოფა
console.log("გაყოფა: " + (num1 / num2));
alert("გაყოფა: " + (num1 / num2));