def ბალანსინახვა(ბ):
    print("ბალანსი არის", ბ, "ლარი")

def დარიცხვა(ბ):
    თ = float(input("რაოდენობა: "))
    ბ = ბ + თ
    print("დარიცხვა შესრულებულია")
    return ბ

def გამოტანა(ბ):
    თ = float(input("რაოდენობა: "))
    if თ <= ბ:
        ბ = ბ - თ
        print("გადახდილია")
    else:
        print("არ გყოფნის თანხა")
    return ბ

def სისტემა():
    სახელი = input("შეიყვანე სახელი: ")
    ბ = 0
    while True:
        print("\n1 - ბალანსი")
        print("2 - დარიცხვა")
        print("3 - გამოტანა")
        print("4 - გასვლა")
        ა = input("აირჩიე: ")
        if ა == "1":
            ბალანსინახვა(ბ)
        elif ა == "2":
            ბ = დარიცხვა(ბ)
        elif ა == "3":
            ბ = გამოტანა(ბ)
        elif ა == "4":
            print("ნახვამდის", სახელი)
            break
        else:
            print("არასწორია")

სისტემა()