#1. პრიორიტეტები:
# and ოპერატორი უფრო პრიორიტეტულია, ვიდრე or, ამიტომ ჯერ and გამოთვლები სრულდება.
# or მუშაობს შემდეგი პრინციპით: თუ მარცხენა მხარე True არის, მარჯვენა მხარეს აღარ ამუშავებს.
# and მუშაობს შემდეგი პრინციპით: თუ მარცხენა მხარე False არის, მარჯვენა მხარეს აღარ ამუშავებს.
#2. ნაბიჯ-ნაბიჯ ამოხსნა:
# პირველი and გამოთვლა:
# 1 and 0=0 1 and 0=0(რადგან and აბრუნებს ბოლო False-ს, ანუ 0-ს.)


#მეორე and გამოთვლა:
#1 and 1=1 1 and 1=1(ორივე მხარე True-ია, ამიტომ აბრუნებს ბოლო მნიშვნელობას, ანუ 1-ს.)

#or გამოთვლა:0 or 0=0 0 or 0=0(ორივე მხარე False-ია, ამიტომ შედეგიც False ანუ 0-ია.)

#მესამე and გამოთვლა:
#(1 and 1) and (0 or 0)⇒1 and 0=0(1 and 1) and (0 or 0)⇒1 and 0=0
#(რადგან and ოპერატორში ერთი მხარე False-ია, საბოლოო შედეგიც False ანუ 0-ია.)

#ბოლო or გამოთვლა:
#0 or 0=0 0 or 0=0 (ორივე მხარე False-ია, საბოლოო შედეგი 0-ია.)