#While და For ციკლების განსხვავება:

#For Loop

#გამოიყენება განსაზღვრული გამეორებისთვის.
#ციკლი გაშვებულია სიის, რიცხვითი დიაპაზონის
#ან სხვა იტერირებადი ობიექტის თითოეული ელემენტისთვის
# მაგალითად :
for i in range(5):
    print(i)  # ბეჭდავს 0-დან 4-მდე რიცხვებს

# While Loop

#გამოიყენება გაურკვეველი გამეორებისთვის, სანამ მოცემული პირობა სიმართლეა.
#ციკლის გაჩერება დამოკიდებულია პირობის ცვლაზე.
# მაგალითად:
# python
# კოპირება
# ჩასწორება
i = 0
while i < 5:
    print(i)
    i += 1  # თუ i-ს არ გავზრდით, ციკლი უსასრულოდ იმუშავებს
#მთავარი განსხვავება:

#for გამოიყენება, როდესაც ზუსტად ვიცით რამდენჯერ უნდა შესრულდეს კოდი.
#while გამოიყენება, როდესაც არ ვიცით, რამდენ ხანს უნდა გაგრძელდეს ციკლი, 
#მაგრამ გვინდა, რომ იმუშაოს კონკრეტული პირობის შესრულებამდე.