# 4. ახსენით, რას გავს range-ში გადაცემული სამი არგუმენტი, არის თუ არა იგივე არგუმენტები, იგივე ფუნქციონალით პითონის სხვა თემაშიც? (start, end, step).

# ამ ფუნქციის მეშვეობით ჩვენ ვავლებთ დიაპაზონს
# range(start, end, step)-ს გადაეცემა 3 არგუმენტი:

# 1. start - საიდან უნდა დაიწყოს 
# 2. end - სად უნდა გაჩერდეს 
# 3. step - რამდენით უნდა გამოტოვოს 







# ასევე არის კიდევ ერთი მგავსი თემაც პითონში ეს არის slicing-ი
# slicing-ის გამოსაყენებლად ჩვენ ვიყენებთ კვადრატულ ფრჩხილებს []

# ამ კვადრატულს ფრჩხილებს გადაეცემა 3 არგუმენტი [start:end:step]

# 1. start - საიდან უნდა დაიწყოს 
# 2. end - სად უნდა გაჩერდეს 
# 3. step - რამდენით უნდა გამოტოვოს 

# მაგ:
# "hello"[1] - რადგან ინდექსაცია 0-იდან იწყება ჩვენ გამოგვიტანს "hello"-ს 2-ე ასოს ანუ "e"
# "hello"[1:4] - ეს გამოგვიტანს 1-დან 4-მდე ასოებს ანუ e-დან l-მდე "ell"
# "hello"[1:4:2] - აქ ეხლა დაიწყებს 1-იდან ანუ e-დან მივა 4-მდე ანუ l-მდე ორის გამოტოვებით შედეგი იქნება "el"
