// მომხმარებელს შევეკითხოთ ორი რიცხვი
let num1 = prompt("შეიყვანეთ პირველი რიცხვი:");
let num2 = prompt("შეიყვანეთ მეორე რიცხვი:");

// გადავაქციოთ რიცხვებად
num1 = Number(num1);
num2 = Number(num2);

// შევამოწმოთ რომელი უფრო დიდია
if (num1 > num2) {
console.log("უფრო დიდი რიცხვია: " + num1);
alert("უფრო დიდი რიცხვია: " + num1);
} else if (num2 > num1) {
console.log("უფრო დიდი რიცხვია: " + num2);
alert("უფრო დიდი რიცხვია: " + num2);
} else {
console.log("ორივე რიცხვი ტოლია");
alert("ორივე რიცხვი ტოლია");
}
