// ობიექტი (Object) არის მონაცემთა ტიპი JavaScript-ში,
// რომელიც შეიცავს ინფორმაციას "key: value" წყვილებით.

// ანუ, ობიექტი გამოიყენება დაკავშირებული მონაცემების შესანახად ერთ სტრუქტურაში.

// ობიექტი იქმნება ფიგურული ფრჩხილებით {}.

// მაგალითი:
const person = {
name: "თემური",   // key არის "name", value არის "თემური"
age: 20,           // key არის "age", value არის 20
city: "რუსთავი"    // key არის "city", value არის "თბილისი"
};

// ობიექტის შიგნით თითოეული ინფორმაცია ინახება როგორც "property" ანუ თვისება.

// ობიექტის მნიშვნელობებზე წვდომა შეიძლება ორნაირად:
// 1. წერტილის სინტაქსით (dot notation)
console.log(person.name); // გამოიტანს "თემური"

// 2. ფრჩხილოვანი სინტაქსით (bracket notation)
console.log(person["age"]); // გამოიტანს 20

// ასევე შეგვიძლია ობიექტში ახალი თვისების დამატება:
person.country = "საქართველო";

// და არსებული მნიშვნელობის შეცვლა:
person.city = "ბათუმი";

// საბოლოოდ ობიექტი ასე გამოიყურება:
console.log(person);
