# 3. მოიყვანეთ მაგალითები, თუ რომელ statement-ებში, 
# ფუნქიცებში ან loop-ებში შეიძლება გამოგვადგეს slicing.


# მაგ: list თუ გვინდა რომ კონკრეტული ნაწილი გამოვიტანოთ ან string-ის კონკრეტული ნაწილი

z = [1, 2, 3, 4, 5]

print(z[1:4])

# ან string

b = "vaxo"

print(b[1:-1])


# ან კიდე for loop-ზე თუ აი ტქსტის ბოლოში ან კიდევ დასაწყისში არასასურველ სიმბოლოებს ან space-ებს გვიმატებს

str = "gamarjoba"
new_string = ""
for i in str:
    new_string += i + "-"

# აი აქ ბოლოშიც დაამატა - ჩვენ კიდე ეს შეგვიძლია მარტივად გადავჭრათ slicing-ით

print(new_string[:-1:])
